In [16]:
import pandas as pd

## Deliberable 1A

In [17]:
begInv = pd.read_csv("BegInvFINAL12-31-16Sample.csv")

In [18]:
begInv = begInv.rename(columns = {'onHand' : '01_01_2016_Qty'})

In [19]:
begInv['InvCost_01_01_2016'] = begInv['01_01_2016_Qty'] * begInv['Price']

In [20]:
begInv.head(2)

,InventoryId,Store,City,Brand,Description,Size,01_01_2016_Qty,Price,startDate,InvCost_01_01_2016
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,8,12.99,2016-01-01,103.92
1,1_HARDERSFIELD_60,1,HARDERSFIELD,60,Canadian Club 1858 VAP,750mL,7,10.99,2016-01-01,76.93

In [22]:
begInv_Store = begInv[['Store','01_01_2016_Qty','InvCost_01_01_2016']].groupby('Store').sum()

In [24]:
begInv_Store.sort_values(by='InvCost_01_01_2016', ascending=False).head(10)

       01_01_2016_Qty  InvCost_01_01_2016
Store
34             153852          3291170.24
73             162551          3142497.36
67             158996          3079578.63
66             149314          2973033.90
76             140208          2952418.44
69             144255          2946726.65
38             114368          2232698.77
55             119641          2001263.66
50              94720          1649808.22
79              95330          1503149.48

## Deliverable 1B

In [30]:
begInv = pd.read_csv("BegInvFINAL12-31-16Sample.csv")

In [31]:
begInv = begInv.rename(columns = {'onHand' : '01_01_2016_Qty'})

In [32]:
begInv['InvCost_01_01_2016'] = begInv['01_01_2016_Qty'] * begInv['Price']

In [34]:
begInv_Brand = begInv[['Brand','01_01_2016_Qty','InvCost_01_01_2016']].groupby('Brand').sum()

In [35]:
begInv_Brand.sort_values(by='InvCost_01_01_2016',ascending=False).head(10)

       01_01_2016_Qty  InvCost_01_01_2016
Brand
3545            14499           463823.01
1233            12016           432455.84
8068            15341           383371.59
4261            15499           340823.01
3858            13649           327439.51
2753             4625           286703.75
8082             9287           278517.13
8680             7066           275503.34
2589             6766           270572.34
3876            14829           266773.71

## Delierable 2A

In [37]:
endInv = pd.read_csv("EndInvFINAL12-31-16Sample.csv")

In [38]:
endInv = endInv.rename(columns = {'onHand':'12_31_2016_Qty'})

In [39]:
endInv['InvCost12_31_2016'] = endInv['12_31_2016_Qty'] * endInv['Price']

In [41]:
endInv_Store = endInv[['Store','12_31_2016_Qty', 'InvCost12_31_2016']].groupby('Store').sum()

In [42]:
endInv_Store.sort_values(by='InvCost12_31_2016',ascending=False).head(10)

       12_31_2016_Qty  InvCost12_31_2016
Store
50             260717         4887260.68
73             164589         3254662.81
67             163765         3076114.82
34             145829         3074616.75
76             143866         2975945.18
69             150848         2968678.82
66             144579         2860504.99
74             166015         2803645.13
38             129397         2463906.85
55             125584         2234836.35

## Deliverable 2B

In [43]:
endInv_Brand=endInv[['Brand','12_31_2016_Qty','InvCost12_31_2016']].groupby('Brand').sum()

In [45]:
endInv_Brand.sort_values(by='InvCost12_31_2016',ascending=False).head(10)

       12_31_2016_Qty  InvCost12_31_2016
Brand
1233            15047          526494.53
3545            16770          502932.30
2753             7849          470861.51
8068            15608          366631.92
3405            12268          355649.32
4261            16769          351981.31
2757            11603          336370.97
2589             7922          300956.78
1376            13180          276648.20
2585            10487          272557.13

## Deliverable 3

In [48]:
begInv_InventoryId = begInv[['InventoryId','01_01_2016_Qty','InvCost_01_01_2016']]

In [50]:
endInv_InventoryId = endInv[['InventoryId','12_31_2016_Qty','InvCost12_31_2016']]

In [51]:
Inv= pd.merge(left = begInv_InventoryId, right = endInv_InventoryId, how = 'outer', on = ['InventoryId'])
Inv = Inv.fillna(0)
Inv.head()

,InventoryId,01_01_2016_Qty,InvCost_01_01_2016,12_31_2016_Qty,InvCost12_31_2016
0,1_HARDERSFIELD_58,8.0,103.92,11.0,142.89
1,1_HARDERSFIELD_60,7.0,76.93,0.0,0.00
2,1_HARDERSFIELD_62,6.0,221.94,7.0,258.93
3,1_HARDERSFIELD_63,3.0,116.97,7.0,272.93
4,1_HARDERSFIELD_72,6.0,209.94,4.0,139.96

## Deliverable 4A

In [57]:
purchases = pd.read_csv("InvoicePurchases12-31-16Sample.csv")

In [58]:
purchases['InvoiceDate'] = pd.to_datetime(purchases['InvoiceDate'])

In [59]:
purchases_2016 = purchases[purchases['InvoiceDate'].dt.year == 2016]

In [60]:
vendor_total_dollars_2016 = purchases_2016[['VendorNumber', 'VendorName','Dollars']].groupby('VendorNumber').sum()

C:\Users\wotchae\AppData\Local\Temp\ipykernel_12044\3028795507.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  vendor_total_dollars_2016 = purchases_2016[['VendorNumber', 'VendorName','Dollars']].groupby('VendorNumber').sum()

In [61]:
vendor_total_dollars_2016.sort_values(by='Dollars', ascending=False).head(10)

                  Dollars
VendorNumber
3960          49733333.66
4425          26851015.81
12546         23539441.79
17035         23460507.21
480           16985053.64
1392          15187741.32
1128          13139921.12
9165          12433070.97
3252          11858245.15
9552          10294481.73

## Deliverable 4B

In [67]:
Invoice_Purchases = pd.read_csv("InvoicePurchases12-31-16Sample.csv")

In [68]:
TopFreightVendors = Invoice_Purchases[['VendorNumber', 'VendorName', 'Freight']].groupby('VendorNumber').sum()

C:\Users\wotchae\AppData\Local\Temp\ipykernel_12044\2358331646.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  TopFreightVendors = Invoice_Purchases[['VendorNumber', 'VendorName', 'Freight']].groupby('VendorNumber').sum()

In [69]:
TopFreightVendors.sort_values(by='Freight',ascending=False).head(10)

                Freight
VendorNumber
3960          257032.07
4425          144929.24
12546         123880.97
17035         123780.22
480            89286.27
1392           79528.99
1128           68601.68
9165           68054.70
3252           61966.91
9552           55551.82

## Deliverable 4C

In [70]:
Invoice_purchases = pd.read_csv("InvoicePurchases12-31-16Sample.csv")

In [74]:
Vendor_summary = Invoice_purchases.groupby('VendorName').agg({'Dollars': 'sum', 'Freight': 'sum'})

In [76]:
high_volume_vendors_summary = Vendor_summary[Vendor_summary['Dollars']>= 250000]

In [77]:
Freight_per_dollar = high_volume_vendors_summary['Freight'] / high_volume_vendors_summary['Dollars']

In [78]:
Freight_per_dollar = Freight_per_dollar.sort_values(ascending=False)

In [79]:
print("Top Ten Vendors with the Highest Freight per $:")
print(Freight_per_dollar.head(10))

Top Ten Vendors with the Highest Freight per $:
VendorName
WESTERN SPIRITS BEVERAGE CO    0.005351
DIAGEO CHATEAU ESTATE WINES    0.005317
FREDERICK WILDMAN & SONS       0.005267
STATE WINE & SPIRITS           0.005240
FLAG HILL WINERY & VINEYARD    0.005237
BANFI PRODUCTS CORP            0.005225
MARTIGNETTI COMPANIES          0.005202
STE MICHELLE WINE ESTATES      0.005158
WINE GROUP INC                 0.005154
ULTRA BEVERAGE COMPANY LLP     0.005152
dtype: float64

In [83]:
print("\n Bottom Fiver Vendors with the Lowest Freight per $:")
bottom_five_freight_per_dollar = Freight_per_dollar.tail(5).sort_values(ascending=True)
bottom_five_freight_per_dollar_df = pd.DataFrame(bottom_five_freight_per_dollar, columns = ['Freight_per_dollar']).reset_index()
print(bottom_five_freight_per_dollar_df)

 Bottom Fiver Vendors with the Lowest Freight per $:
                    VendorName  Freight_per_dollar
0  OLE SMOKY DISTILLERY LLC               0.004958
1  TREASURY WINE ESTATES                  0.004981
2  SIDNEY FRANK IMPORTING CO              0.004983
3  HEAVEN HILL DISTILLERIES               0.004995
4  LUXCO INC                              0.005002

## Deliverable 4D

In [87]:
filtered_transactions = purchases[(purchases['Freight']>100) & (purchases['Quantity']<= 1000)]

In [88]:
highest_freight_vendors = filtered_transactions.groupby('VendorNumber')[['VendorName', 'Freight','Dollars','Quantity']].sum

In [89]:
highest_freight_vendors.sort_values(by='Freight', ascending=False).head(5)

AttributeError: 'function' object has no attribute 'sort_values'